# Zoom Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PrintParameters..::..Zoom Property
PrintParameters Class See Also
---
The zoom value to a percentage of the original size.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int Zoom { get; set; }
```

Visual Basic
---
```text
Public Property Zoom As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int Zoom {
	int get ();
	void set (int value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown if current ZoomType is not Zoom type. |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | Thrown if input zoom value less than 1. |

# See Also
PrintParameters Class
Autodesk.Revit.DB Namespace